---
kind: property
id: P:Autodesk.Revit.DB.ImageType.Resolution
source: html/f87ffd66-9385-3380-d1fd-41fe0f045067.htm
---
# Autodesk.Revit.DB.ImageType.Resolution Property

The size of the pixels in the image, expressed in dots-per-inch (dpi)

## Syntax (C#)
```csharp
public double Resolution { get; }
```